# DockableFrameFocusChangedEventArgs Properties

---
The DockableFrameFocusChangedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancellable|  Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs)
| FocusGained|  True if the pane is being activated, false if it is being inactivated.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs)
| PaneId|  The identifier for dockable pane.
Top
#### Reference
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace